## Plan Result (prod_video_hearings - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.environment[&#34;prod&#34;].time_rotating.one_year
* Replace
  * module.environment[&#34;prod&#34;].azuread_application_password.token




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.environment["prod"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name        = (known after apply)
      ~ end_date            = "2025-10-20T07:05:32.5972586Z" -> (known after apply)
      ~ id                  = "39e7e661-340b-4cbd-b5b7-88406722eda6/password/cfb01b30-56e8-4d9b-92c0-6268103e7730" -> (known after apply)
      ~ key_id              = "cfb01b30-56e8-4d9b-92c0-6268103e7730" -> (known after apply)
      ~ rotate_when_changed = { # forces replacement
          - "rotation" = "2023-09-28T07:05:11Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2023-10-20T07:05:32.5972586Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["prod"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.environment["prod"].time_rotating.one_year has been deleted
  - resource "time_rotating" "one_year" {
      - id               = "2023-09-28T07:05:11Z" -> null
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":115,"Program":"tfcmt","SHA1":"","Target":"prod_video_hearings - TerraformPlanApply","Vars":{}} -->